## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## 동일 간격 Grid 설정
## - 프레임/윈도우(그리드의 부모)에서 제공 메서드
##  * 행과 열 설정
##  * grid_rowconfigure() / grid_columnconfigure()
##      -> 매개변수
##          weight   : 남는 세로/가로 공간 분배 비율 0(기본, 안늘어남), 1, 2.. (크면 더 많이 가져감)
##          minsize  : 해당 행/열의 최소 높이(px)   픽셀값(예: 80)
##          uniform  : 같은 키를 가진 행들의 높이를 동일하게 문자열 키(예: "row")
##                     같은 키끼리 동일 높이로 강제
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성
window=tkinter.Tk()
window.title("** Equal Grid **")
window.geometry("900x400")


## - 전역변수
ROWS = 3
COLS = 3
COLORS = ('yellow', 'lightblue', 'pink')  ##("E3F2FD", "#BBDEFB", "#90CAF9")
WEIGHTS = (1,2,3)

## --------------------------------------------------------------------
##- 윈도우에 배치될 행과 열 설정
## --------------------------------------------------------------------
# 세로 3등분
for r in range(ROWS):
    window.grid_rowconfigure(r, weight=1, uniform="row")

# 가로 3등분
for c in range(COLS):
    window.grid_columnconfigure(c, weight=1, uniform="col")



## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()